tests/reports/load/prod_concurrent_users.txt

> tests@1.0.0 test:load:prod /Users/subhajitgorai/Codes/current_projects/opencanvas/tests
> artillery run load-test.yml -e prod

Test run id: tn6pf_cyprazb9g687tyw5fjbaefhk8gmcg_qge9
Phase started: Sustained load (index: 0, duration: 30s) 16:36:59(+0530)

--------------------------------------
Metrics for period to: 16:37:10(+0530) (width: 9.908s)
--------------------------------------

http.codes.200: ................................................................ 95
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 201
  max: ......................................................................... 584
  mean: ........................................................................ 258.8
  median: ...................................................................... 228.2
  p95: ......................................................................... 368.8
  p99: ......................................................................... 415.8
http.response_time.2xx:
  min: ......................................................................... 201
  max: ......................................................................... 584
  mean: ........................................................................ 258.8
  median: ...................................................................... 228.2
  p95: ......................................................................... 368.8
  p99: ......................................................................... 415.8
http.responses: ................................................................ 95
vusers.completed: .............................................................. 94
vusers.created: ................................................................ 100
vusers.created_by_name.Fetch educational articles: ............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 346.2
  max: ......................................................................... 797.4
  mean: ........................................................................ 448.9
  median: ...................................................................... 432.7
  p95: ......................................................................... 596
  p99: ......................................................................... 658.6


--------------------------------------
Metrics for period to: 16:37:20(+0530) (width: 9.958s)
--------------------------------------

http.codes.200: ................................................................ 100
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 202
  max: ......................................................................... 469
  mean: ........................................................................ 235.9
  median: ...................................................................... 223.7
  p95: ......................................................................... 327.1
  p99: ......................................................................... 407.5
http.response_time.2xx:
  min: ......................................................................... 202
  max: ......................................................................... 469
  mean: ........................................................................ 235.9
  median: ...................................................................... 223.7
  p95: ......................................................................... 327.1
  p99: ......................................................................... 407.5
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Fetch educational articles: ............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 347.4
  max: ......................................................................... 622.2
  mean: ........................................................................ 428.8
  median: ...................................................................... 424.2
  p95: ......................................................................... 539.2
  p99: ......................................................................... 620.3


Phase completed: Sustained load (index: 0, duration: 30s) 16:37:29(+0530)

--------------------------------------
Metrics for period to: 16:37:30(+0530) (width: 9.932s)
--------------------------------------

http.codes.200: ................................................................ 99
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 197
  max: ......................................................................... 386
  mean: ........................................................................ 230
  median: ...................................................................... 219.2
  p95: ......................................................................... 301.9
  p99: ......................................................................... 340.4
http.response_time.2xx:
  min: ......................................................................... 197
  max: ......................................................................... 386
  mean: ........................................................................ 230
  median: ...................................................................... 219.2
  p95: ......................................................................... 301.9
  p99: ......................................................................... 340.4
http.responses: ................................................................ 99
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Fetch educational articles: ............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 336.7
  max: ......................................................................... 567
  mean: ........................................................................ 418.7
  median: ...................................................................... 424.2
  p95: ......................................................................... 487.9
  p99: ......................................................................... 550.1


--------------------------------------
Metrics for period to: 16:37:40(+0530) (width: 0.307s)
--------------------------------------

http.codes.200: ................................................................ 6
http.response_time:
  min: ......................................................................... 212
  max: ......................................................................... 392
  mean: ........................................................................ 261.3
  median: ...................................................................... 228.2
  p95: ......................................................................... 278.7
  p99: ......................................................................... 278.7
http.response_time.2xx:
  min: ......................................................................... 212
  max: ......................................................................... 392
  mean: ........................................................................ 261.3
  median: ...................................................................... 228.2
  p95: ......................................................................... 278.7
  p99: ......................................................................... 278.7
http.responses: ................................................................ 6
vusers.completed: .............................................................. 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 411.8
  max: ......................................................................... 635.7
  mean: ........................................................................ 477.6
  median: ...................................................................... 432.7
  p95: ......................................................................... 487.9
  p99: ......................................................................... 487.9


All VUs finished. Total time: 32 seconds

--------------------------------
Summary report @ 16:37:32(+0530)
--------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 197
  max: ......................................................................... 584
  mean: ........................................................................ 241.7
  median: ...................................................................... 223.7
  p95: ......................................................................... 361.5
  p99: ......................................................................... 415.8
http.response_time.2xx:
  min: ......................................................................... 197
  max: ......................................................................... 584
  mean: ........................................................................ 241.7
  median: ...................................................................... 223.7
  p95: ......................................................................... 361.5
  p99: ......................................................................... 415.8
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Fetch educational articles: ............................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 336.7
  max: ......................................................................... 797.4
  mean: ........................................................................ 432.7
  median: ...................................................................... 424.2
  p95: ......................................................................... 561.2
  p99: ......................................................................... 632.8